{
  "Strategic Architecture": {
    "name": "Strategic Architecture",
    "description": "The Strategic Architecture layer focuses on aligning the organization's direction, priorities, capabilities, and risk posture to achieve its mission and vision.",
    "orientation": "front",
    "position": {
      "row": 1,
      "col": 1,
      "colspan": 2
    },
    "color": "#003366",
    "layers": {
      "Mission & Vision": {
        "name": "Mission & Vision",
        "description": "Defines the organization's aspirational long-term goals and core purpose.",
        "position": {
          "row": 1,
          "col": 1,
          "colspan": 3
        },
        "layers": {
          "Vision Statement": {
            "name": "Vision Statement",
            "description": "A clear and compelling declaration of the organization’s long-term aspirations and the broad societal or community outcomes it seeks to achieve.",
            "position": {
              "row": 1,
              "col": 1
            }
          },
          "Mission Statement": {
            "name": "Mission Statement",
            "description": "Defines the organization’s core purpose, including whom it serves, what it does, and why it matters within its public mandate.",
            "position": {
              "row": 1,
              "col": 2
            }
          },
          "Leadership Aspirations": {
            "name": "Leadership Aspirations",
            "description": "Captures the strategic priorities, values, and transformational ambitions expressed by organizational leadership and key internal or external stakeholders, reflecting the organization's intentional direction.",
            "position": {
              "row": 2,
              "col": 1
            }
          },
          "Community and Constituent Input": {
            "name": "Community and Constituent Input",
            "description": "Reflects the needs, expectations, and feedback from the communities and constituents served by the organization. This input ensures the mission and vision remain relevant, responsive, and people-centered.",
            "position": {
              "row": 2,
              "col": 2
            }
          },
          "Narrative of Action": {
            "name": "Narrative of Action",
            "description": "Explains how the vision and mission adapt over time to address evolving societal needs, emerging trends, and environmental shifts, maintaining ongoing relevance and strategic focus.",
            "position": {
              "row": 3,
              "col": 1
            }
          }
        }
      },
      "Strategy & Priorities": {
        "name": "Strategy & Priorities",
        "description": "Identifies the medium- to long-term outcomes and key focus areas necessary to achieve the vision.",
        "position": {
          "row": 2,
          "col": 1,
          "rowspan": 3
        },
        "layers": {
          "Strategic Objectives": {
            "name": "Strategic Objectives",
            "description": "Broad outcomes derived from the mission, often multi-year and cross-cutting. These provide a thematic anchor for programs and policies, such as 'advance digital equity' or 'modernize infrastructure.'",
            "position": {
              "row": 1,
              "col": 1
            }
          },
          "Organizational Priorities": {
            "name": "Organizational Priorities",
            "description": "Focused, often time-bound initiatives or targets set by leadership or policy (e.g., 'achieve 80% digital service adoption by 2027'). They reflect what’s urgent, funded, or politically salient.",
            "position": {
              "row": 1,
              "col": 2
            }
          },
          "Performance Indicators (KPIs)": {
            "name": "Performance Indicators (KPIs)",
            "description": "Measurable indicators tied to each goal and priority. These allow organizations to track progress, assess impact, and recalibrate initiatives as needed.",
            "position": {
              "row": 2,
              "col": 1
            }
          },
          "Alignment Map": {
            "name": "Alignment Map",
            "description": "Illustrates how goals align across departments or programs, promoting coordinated efforts.",
            "position": {
              "row": 2,
              "col": 2
            }
          }
        }
      },
      "Value Streams & Capabilities": {
        "name": "Value Streams & Capabilities",
        "description": "Outlines the key value flows and enabling capabilities required to deliver on the strategy and mission.",
        "position": {
          "row": 2,
          "col": 3,
          "rowspan": 3
        },
        "layers": {
          "Constituent Service Journeys": {
            "name": "Constituent Service Journeys",
            "description": "Narrative and visual maps depicting how individuals or groups engage with the organization—from initial contact and onboarding through service delivery and follow-up. These journeys highlight pain points, experience gaps, and areas for innovation.",
            "position": {
              "row": 1,
              "col": 1
            }
          },
          "Cross-Agency Coordination": {
            "name": "Cross-Agency Coordination",
            "description": "Identification of touchpoints where multiple departments or partner organizations contribute to delivering a single value stream, underscoring the need for integrated platforms, data sharing, and common standards.",
            "position": {
              "row": 1,
              "col": 2
            }
          },
          "Outcome Measures": {
            "name": "Outcome Measures",
            "description": "Success criteria defined from the constituent’s perspective—such as reduced wait times, equitable access, or simplified application processes—that ensure transformation remains focused on public value and citizen-centric results.",
            "position": {
              "row": 2,
              "col": 1
            }
          },
          "Enterprise Capabilities Map": {
            "name": "Enterprise Capabilities Map",
            "description": "A structured representation of core and enabling capabilities that support value streams, linking organizational strengths and resources to constituent outcomes.",
            "position": {
              "row": 2,
              "col": 2
            }
          },
          "Capability Maturity Assessment": {
            "name": "Capability Maturity Assessment",
            "description": "Evaluation of current-state versus future-state capability levels to identify gaps, prioritize capability development, and guide investment decisions.",
            "position": {
              "row": 3,
              "col": 1
            }
          },
          "Value Stream Maps": {
            "name": "Value Stream Maps",
            "description": "High-level flow diagrams illustrating how capabilities, processes, and partners collaborate to deliver value to constituents, serving as a blueprint for transformation initiatives.",
            "position": {
              "row": 3,
              "col": 2
            }
          }
        }
      },
      "Policy & Compliance": {
        "name": "Policy & Compliance",
        "description": "Documents the legal, regulatory, and policy frameworks guiding the organization’s operations and architecture.",
        "position": {
          "row": 3,
          "col": 2,
          "rowspan": 1
        },
        "layers": {
          "Mandates and Statutes": {
            "name": "Mandates and Statutes",
            "description": "Foundational legal texts, executive orders, and statutory requirements that establish non-negotiable obligations the organization must meet. These serve as the baseline for compliance and architecture constraints.",
            "position": {
              "row": 1,
              "col": 1
            }
          },
          "Strategic Policy Themes": {
            "name": "Strategic Policy Themes",
            "description": "Broad government initiatives and thematic priorities—such as AI ethics, sustainability, privacy, or digital inclusion—that shape innovation space and strategic direction across departments and programs.",
            "position": {
              "row": 1,
              "col": 2
            }
          },
          "Compliance Frameworks": {
            "name": "Compliance Frameworks",
            "description": "Operational standards and requirements derived from policy, including data privacy, security, accessibility, and retention policies, which must be embedded in system architectures, processes, and controls.",
            "position": {
              "row": 2,
              "col": 1
            }
          },
          "Guiding Policies": {
            "name": "Guiding Policies",
            "description": "Strategic-level policies that provide overarching principles and objectives, directing organizational actions and investments in alignment with government priorities.",
            "position": {
              "row": 2,
              "col": 2
            }
          },
          "Regulatory Context": {
            "name": "Regulatory Context",
            "description": "High-level compliance obligations and enforcement mechanisms that govern organizational adherence to laws, regulations, and standards.",
            "position": {
              "row": 3,
              "col": 1
            }
          },
          "Strategic Directives": {
            "name": "Strategic Directives",
            "description": "Top-down mandates, reform initiatives, or legislative reforms issued by leadership or government bodies that drive change and transformation within the organization.",
            "position": {
              "row": 3,
              "col": 2
            }
          }
        }

      },
      "Risk & Resilience": {
        "name": "Risk & Resilience",
        "description": "Addresses the organization's ability to anticipate, mitigate, and recover from risks while maintaining operational continuity.",
        "position": {
          "row": 2,
          "col": 2
        },
        "layers": {
          "Risk Identification & Prioritization": {
            "name": "Risk Identification & Prioritization",
            "description": "Systematic identification, analysis, and ranking of mission-critical risks—including cyber threats, operational vulnerabilities, and external disruptions—maintained in strategic risk registries.",
            "position": {
              "row": 1,
              "col": 1
            }
          },
          "Resilience Capabilities": {
            "name": "Resilience Capabilities",
            "description": "Investments and initiatives that build organizational continuity, such as disaster recovery plans, workforce adaptability programs, and flexible infrastructure designs, ensuring sustained service delivery under stress.",
            "position": {
              "row": 1,
              "col": 2
            }
          },
          "Adaptive Governance": {
            "name": "Adaptive Governance",
            "description": "Structures and processes that enable rapid decision-making, iterative policy and architectural adjustments, flexible resource allocation, and empowered leadership during crises or fast-changing environments.",
            "position": {
              "row": 2,
              "col": 1
            }
          },
          "Strategic Risk Assessment": {
            "name": "Strategic Risk Assessment",
            "description": "Comprehensive evaluation of risks impacting the achievement of mission and strategic goals, including emerging threats and systemic vulnerabilities.",
            "position": {
              "row": 2,
              "col": 2
            }
          },
          "Resilience Posture": {
            "name": "Resilience Posture",
            "description": "The organization’s overall capacity for continuity, adaptability, and recovery is assessed through defined metrics and maturity models.",
            "position": {
              "row": 3,
              "col": 1
            }
          },
          "Contingency Plans": {
            "name": "Contingency Plans",
            "description": "High-level frameworks and actionable playbooks outlining response strategies, recovery actions, and communication protocols to manage crises and restore operations.",
            "position": {
              "row": 3,
              "col": 2
            }
          }
        }
      },
      "Roadmap": {
        "name": "Roadmap",
        "description": "Defines the key milestones, dependencies, and timelines for achieving strategic objectives and transformation initiatives.",
        "position": {
          "row": 4,
          "col": 2
        },
        "layers": {
          "Current-State Assessments": {
            "name": "Current-State Assessments",
            "description": "In-depth diagnostics of existing capabilities, systems, processes, and workforce readiness, providing a comprehensive baseline to identify strengths, gaps, and key challenges.",
            "position": {
              "row": 1,
              "col": 1
            }
          },
          "Transformation Roadmaps": {
            "name": "Transformation Roadmaps",
            "description": "Sequenced plans that outline how the organization will transition across people, processes, technology, and policy dimensions, linking initiatives and investments to strategic goals.",
            "position": {
              "row": 1,
              "col": 2
            }
          },
          "Strategic Foresight Activities": {
            "name": "Strategic Foresight Activities",
            "description": "Ongoing activities such as scenario planning, horizon scanning, and trend monitoring that prepare the organization for multiple plausible futures, enabling flexible and forward-looking decision-making.",
            "position": {
              "row": 2,
              "col": 1
            }
          },
          "Current-State Description": {
            "name": "Current-State Description",
            "description": "Clear articulation of the present operating environment, including capabilities, pain points, and organizational context.",
            "position": {
              "row": 2,
              "col": 2
            }
          },
          "Future-State Vision": {
            "name": "Future-State Vision",
            "description": "Definition of the target operating model, describing desired capabilities, organizational structure, technology platforms, and policy environment.",
            "position": {
              "row": 3,
              "col": 1
            }
          },
          "Transformation Initiatives": {
            "name": "Transformation Initiatives",
            "description": "Specific programs, projects, and investments aligned with strategic objectives, prioritized to drive incremental and breakthrough change.",
            "position": {
              "row": 3,
              "col": 2
            }
          },
          "Time Horizons": {
            "name": "Time Horizons",
            "description": "Planning phases that segment transformation efforts into short-term (1 year), medium-term (3 years), and long-term (5+ years) outlooks, providing clarity on sequencing and pacing.",
            "position": {
              "row": 4,
              "col": 1
            }
          }
        }
      }
    }
  },
  "Physical Architecture": {
    "name": "Physical Architecture",
    "description": "Physical Architecture contains all of the devices, locations, and connectivity in the system.",
    "orientation": "right",
    "position": {
      "row": 3,
      "col": 1
    },
    "color": "#708090",
    "assets": {
      "GEAR1": {
        "name": "GEAR Architecture document",
        "url": "https://www.intel.com/content/www/us/en/content-details/790385/government-conceptual-enterprise-architecture-gear.html?wapkw=Government%20Enterprise%20Architecture",
        "description": "Overview of the GEAR architecture and its uses."
      },
      "GEAR2": {
        "name": "GEAR Security Architecture document",
        "url": "https://www.intel.com/content/www/us/en/content-details/790385/government-conceptual-enterprise-architecture-gear.html?wapkw=Government%20Enterprise%20Architecture",
        "description": "The Security Aspect of the Government Enterprise Architecture Reference (GEAR) Logical View integrates protection mechanisms such as encryption, intrusion detection, and threat mitigation across all layers of the architecture. It ensures that all parts of the enterprise are safeguarded against evolving threats by embedding security measures into the Organizational, Process, and Physical Layers. This approach enables a resilient, policy driven environment capable of addressing diverse threats across every architecture layer"
      },
      "GEARVideo": {
        "name": "Video: Government Enterprise Architecture Basics: A Simple Explanation",
        "url": "https://www.youtube.com/watch?v=Ou9FHodTamk",
        "description": "In this episode, we delve into the world of leveraging enterprise architecture in government settings, specifically focusing on the benefits and strategies involved. From understanding the fundamentals of enterprise architecture frameworks to embracing digital transformation, we explore how organizations can drive value and efficiency through proper architectural planning. Join us as we discuss the significance of architecture in government operations and the role it plays in achieving organizational goals. If you are interested in learning more about enterprise architecture and its impact on government entities, this insightful discussion is for you."
      }
    },
    "layers": {
      "Machines": {
        "name": "Machines",
        "description": "Machines include non digital and digital machines that interact with the physical world.",
        "position": {
          "row": 1,
          "col": 1,
          "rowspan": 2
        },
        "layers": {
          "Manual Input Devices": {
            "name": "Manual Input Machines",
            "description": "Machines operated by humans to provide direct input to the system.\n\nPush buttons\n\nSelector switches\n\nFoot pedals\n\nEmergency stop switches\n\nHandwheels and levers with feedback",
            "position": {
              "row": 1,
              "col": 1,
              "colspan": 3
            }
          },
          "Sensors": {
            "name": "Sensors",
            "description": "Machines that measure physical parameters from the process. Temperature sensors (RTDs, thermocouples)\n\nPressure transducers\n\nFlow meters\n\nLevel sensors (ultrasonic, float)\n\nProximity and position sensors (inductive, optical)\n\nSpeed/rotation sensors (encoders, tachometers)\n\nChemical/gas sensors (pH, CO₂, VOCs)",
            "position": {
              "row": 1,
              "col": 4,
              "colspan": 3
            }
          },
          "Composite Machines": {
            "name": "Composite Machines",
            "description": "Assemblies that combine sensors, actuators, controllers, and logic into an integrated device.\n\nRobotic arms (with encoders, motors, force sensors)\n\nCNC machines\n\nAutonomous guided vehicles (AGVs)\n\nSmart conveyor modules\n\nPackaging machines with embedded control\n\nPick-and-place machines",
            "position": {
              "row": 2,
              "col": 1,
              "colspan": 6
            }
          },
          "Motion Acuators": {
            "name": "Motion Acuators",
            "description": "Machines that cause linear or rotary movement in mechanical systems.\n\nElectric motors (AC, DC, servo, stepper)\n\nPneumatic or hydraulic cylinders\n\nLinear actuators\n\nRotary actuators\n\nDrives and motor controllers",
            "position": {
              "row": 3,
              "col": 1,
              "colspan": 2
            }
          },
          "Flow Acuators": {
            "name": "Flow Acuators",
            "description": "Machines that regulate flow of liquids, gases, or materials in the process.\n\nSolenoid valves\n\nControl valves (pneumatic, electric)\n\nDosing pumps\n\nDampers and gates\n\nHeaters (used to control thermal flow)",
            "position": {
              "row": 3,
              "col": 3,
              "colspan": 2
            }
          },
          "Signal and Power Switching": {
            "name": "Signal and Power Switching",
            "description": "Machines that switch electrical signals or power to machines.\n\nRelays\n\nContactors\n\nSolid-state switches\n\nCircuit breakers (with signaling)\n\nInterposing relays",
            "position": {
              "row": 3,
              "col": 5,
              "colspan": 2
            }
          }

        }
      },
      "Devices": {
        "name": "Devices",
        "description": "Devices represent all physical devices involved in the system's operation, such as sensors and hardware endpoints.",
        "position": {
          "row": 1,
          "col": 2
        },
        "layers": {
          "Dynamic Edge Devices": {
            "name": "Dynamic Edge Devices",
            "description": "Dynamic Edge Devices are adaptive, location-dependent devices connecting users to systems.",
            "position": {
              "row": 1,
              "col": 1
            }
          },
          "Operations Devices": {
            "name": "Operations Devices",
            "description": "Devices used for operational workflows, ensuring smooth day-to-day system functioning.",
            "position": {
              "row": 1,
              "col": 2
            }
          },
          "Enterprise Devices": {
            "name": "Enterprise Devices",
            "description": "Enterprise-level devices supporting organizational goals, such as servers and high-performance hardware.",
            "position": {
              "row": 1,
              "col": 3
            }
          },
          "Multi-Hybrid Cloud": {
            "name": "Multi-Hybrid Cloud",
            "description": "Multi-Hybrid Cloud systems represent cloud environments supporting connectivity and scaling across devices.",
            "position": {
              "row": 1,
              "col": 4
            }
          }
        }
      },
      "Communications": {
        "name": "Communications",
        "description": "Communication represents the physical network and protocols connecting devices within locations.",
        "position": {
          "row": 2,
          "col": 2
        }
      },
      "Locations": {
        "description": "Locations define geographic and logical places in the system where resources are located.",
        "position": {
          "row": 3,
          "col": 1,
          "colspan": 2
        },
        "layers": {
          "Dynamic Locations": {
            "description": "Dynamic Locations are movable and adaptive spaces, such as temporary work areas or mobile units.",
            "position": {
              "row": 1,
              "col": 1
            }
          },
          "Operations Locations": {
            "description": "Locations used for managing and monitoring operational tasks in the system.",
            "position": {
              "row": 1,
              "col": 2
            }
          },
          "Hybrid Offices": {
            "description": "Merged work and home environments supporting hybrid work practices.",
            "position": {
              "row": 1,
              "col": 3
            }
          },
          "Datacenters": {
            "description": "Dedicated locations that store and manage system-critical data and applications.",
            "position": {
              "row": 1,
              "col": 4
            }
          },
          "Outsourced Locations": {
            "description": "Third-party-managed spaces where some system operations are handled.",
            "position": {
              "row": 1,
              "col": 5
            }
          }
        }
      }
    }
  },
  "Digital Architecture": {
    "name": "Digital Architecture",
    "description": "Software stack of the system, including the middleware, software and applications.",
    "orientation": "front",
    "color": "#6a0dad",
    "position": {
      "row": 3,
      "col": 2
    },
    "assets": {
      "GEAR4": {
        "name": "GEAR Architecture document",
        "url": "https://www.intel.com/content/www/us/en/content-details/790385/government-conceptual-enterprise-architecture-gear.html?wapkw=Government%20Enterprise%20Architecture",
        "description": "Overview of the GEAR architecture and its uses."
      },
      "GEARVideo": {
        "name": "Video: Government Enterprise Architecture Basics: A Simple Explanation",
        "url": "https://www.youtube.com/watch?v=Ou9FHodTamk",
        "description": "In this episode, we delve into the world of leveraging enterprise architecture in government settings, specifically focusing on the benefits and strategies involved. From understanding the fundamentals of enterprise architecture frameworks to embracing digital transformation, we explore how organizations can drive value and efficiency through proper architectural planning. Join us as we discuss the significance of architecture in government operations and the role it plays in achieving organizational goals. If you are interested in learning more about enterprise architecture and its impact on government entities, this insightful discussion is for you."
      }
    },
    "layers": {
      "Application Layer": {
        "description": "Handles user-facing applications, ensuring interaction between system and users.",
        "position": {
          "row": 1,
          "col": 2,
          "colspan": 2
        },
        "layers": {
          "Analytics Services": {
            "position": {
              "row": 1,
              "col": 1
            }
          },
          "AI ML Services": {
            "position": {
              "row": 1,
              "col": 2
            }
          },
          "Workflow Services": {
            "position": {
              "row": 1,
              "col": 3
            }
          },
          "Developer Services": {
            "position": {
              "row": 2,
              "col": 1,
              "colspan": 3
            }
          }
        }
      },
      "Distributed Information Management Layer": {
        "description": "Oversees the efficient distribution and access of system data across modules.",
        "position": {
          "row": 2,
          "col": 2,
          "colspan": 1
        },
        "layers": {
          "Data Definition Framework": {
            "position": {
              "row": 1,
              "col": 1,
              "rowspan": 2
            }
          },
          "Data Management Layer": {
            "position": {
              "row": 1,
              "col": 2
            }
          },
          "Common Data Services": {
            "position": {
              "row": 2,
              "col": 2
            }
          }
        }
      },
      "Service Management Layer": {
        "description": "Monitors and controls services for smooth operation and functionality.",
        "position": {
          "row": 2,
          "col": 3
        },
        "layers": {
          "Service Repository": {
            "position": {
              "row": 2,
              "col": 1
            }
          },
          "Environment Manager": {
            "position": {
              "row": 1,
              "col": 2
            }
          },
          "Service Orchestration": {
            "position": {
              "row": 1,
              "col": 3
            }
          },
          "Common Data Services": {
            "position": {
              "row": 2,
              "col": 2,
              "colspan": 2
            }
          }
        }
      },
      "Software Defined Infrastructure": {
        "description": "Focuses on abstract control over underlying hardware through software.",
        "position": {
          "row": 3,
          "col": 2,
          "colspan": 2
        },
        "layers": {
          "Orchestration": {
            "position": {
              "row": 1,
              "col": 1,
              "colspan": 5
            }
          },
          "Compute": {
            "position": {
              "row": 2,
              "col": 1,
              "colspan": 1
            }
          },
          "Storage": {
            "position": {
              "row": 2,
              "col": 2,
              "colspan": 1
            }
          },
          "Network": {
            "position": {
              "row": 2,
              "col": 3,
              "colspan": 1
            }
          },
          "Accelerators": {
            "position": {
              "row": 2,
              "col": 4,
              "colspan": 1
            }
          },
          "Security": {
            "position": {
              "row": 2,
              "col": 5,
              "colspan": 1
            }
          }
        }
      },
      "Physical Layer": {
        "description": "Acts as the logical representation of the lower physical layer.",
        "position": {
          "row": 4,
          "col": 2,
          "colspan": 2
        },
        "layers": {
          "Edge Devices": {
            "position": {
              "row": 1,
              "col": 1
            }
          },
          "OT Devices": {
            "position": {
              "row": 1,
              "col": 2,
              "colspan": 1
            }
          },
          "Mobile Devices": {
            "position": {
              "row": 1,
              "col": 3,
              "colspan": 1
            }
          },
          "Labtops and Desktops": {
            "position": {
              "row": 1,
              "col": 4,
              "colspan": 1
            }
          },
          "Datacenter Devices": {
            "position": {
              "row": 2,
              "col": 1,
              "colspan": 1
            }
          },
          "Private Cloud": {
            "position": {
              "row": 2,
              "col": 2,
              "colspan": 1
            }
          },
          "Public Cloud": {
            "position": {
              "row": 2,
              "col": 3,
              "colspan": 1
            }
          }
        }
      },
      "Identity Aspect": {
        "description": "Manages all identity-related elements like authentication and user properties.",
        "position": {
          "row": 1,
          "col": 1,
          "rowspan": 4
        },
        "layers": {
          "Access": {
            "position": {
              "row": 1,
              "col": 1
            }
          },
          "Authorization": {
            "position": {
              "row": 2,
              "col": 1
            }
          },
          "Authentication": {
            "position": {
              "row": 3,
              "col": 1
            }
          },
          "Key Management": {
            "position": {
              "row": 4,
              "col": 1
            }
          }
        }
      },
      "Security Aspect": {
        "name": "Security Aspect",
        "description": "Manages all identity-related elements like authentication and user properties.",
        "position": {
          "row": 1,
          "col": 4,
          "rowspan": 4
        },
        "assets": {
          "GEAR3": {
            "name": "GEAR Security Architecture document",
            "url": "https://www.intel.com/content/www/us/en/content-details/790385/government-conceptual-enterprise-architecture-gear.html?wapkw=Government%20Enterprise%20Architecture",
            "description": "The Security Aspect of the Government Enterprise Architecture Reference (GEAR) Logical View integrates protection mechanisms such as encryption, intrusion detection, and threat mitigation across all layers of the architecture. It ensures that all parts of the enterprise are safeguarded against evolving threats by embedding security measures into the Organizational, Process, and Physical Layers. This approach enables a resilient, policy driven environment capable of addressing diverse threats across every architecture layer"
          }
        },
        "layers": {
          "Architecture & Trust Foundations": {
            "description": "Establishes principles of security by design and zero-trust architecture, defining core building blocks like product assurance, secure boot, attestation, and trusted execution environments.",
            "position": {
              "row": 4,
              "col": 1,
              "colspan": 3
            },
            "layers": {
              "Product Security Assurance & Secure Supply Chain": {
                "description": "Ensures hardware and firmware integrity through proactive issue remediation and secure supply chain practices.",
                "position": {
                  "row": 1,
                  "col": 1
                }
              },
              "Zero Trust Architecture": {
                "description": "Assumes all computing operates in a hostile environment, enforcing strict identity-based authentication and authorization.",
                "position": {
                  "row": 2,
                  "col": 1
                }
              },
              "Root of Trust": {
                "description": "Incorporates hardware-based security technologies to establish a foundation of trust within the execution environment.",
                "position": {
                  "row": 3,
                  "col": 1
                }
              },
              "Secure Boot & Attestation": {
                "description": "Ensures systems start and operate only with verified and authorized code, preventing execution of malicious or tampered code.",
                "position": {
                  "row": 4,
                  "col": 1
                }
              }
            },
            "Trusted Execution Environments (TEE) / Confidential Computing": {
              "description": "Protects data in use in shared environments, ensuring only authorized users have access and preventing tampering, viewing, or theft.",
              "position": {
                "row": 5,
                "col": 1
              }
            }
          },
          "Infrastructure & Host Security": {
            "description": "Enforces hardening and protective measures across servers, containers, and edge devices, including runtime protections, host-based firewalls, and endpoint detection and response.",
            "position": {
              "row": 2,
              "col": 1
            },
            "layers": {
              "System Hardening": {
                "description": "Reduces the attack surface by configuring and securing software components to minimize vulnerabilities.",
                "position": {
                  "row": 1,
                  "col": 1
                }
              },
              "Runtime Protection": {
                "description": "Maintains secure execution environments for applications, containers, and virtual machines during runtime.",
                "position": {
                  "row": 2,
                  "col": 1
                }
              },
              "Host-based Firewalls & EDR": {
                "description": "Safeguards individual systems and endpoints by filtering network traffic and detecting potential threats.",
                "position": {
                  "row": 3,
                  "col": 1
                }
              },
              "Edge Security": {
                "description": "Ensures devices and systems operating at the network's edge are protected against physical and cyber threats.",
                "position": {
                  "row": 4,
                  "col": 1
                }
              }
            }
          },
          "Network & Communications Security": {
            "description": "Protects the confidentiality and integrity of data in motion, leveraging technologies like microsegmentation, SDN-based controls, and pervasive encryption.",
            "position": {
              "row": 3,
              "col": 1,
              "colspan": 2
            },
            "layers": {
              "East-West & North-South Encryption": {
                "description": "Secures traffic entering, exiting, and moving laterally within a network to maintain data confidentiality and integrity.",
                "position": {
                  "row": 1,
                  "col": 1
                }
              },
              "Microsegmentation": {
                "description": "Divides networks into granular, isolated segments with tailored security policies to prevent lateral movement of threats.",
                "position": {
                  "row": 2,
                  "col": 1
                }
              },
              "SDN Security": {
                "description": "Applies dynamic security policies and monitors traffic flows in real time using a centralized controller.",
                "position": {
                  "row": 3,
                  "col": 1
                }
              },
              "DDoS Protection": {
                "description": "Protects against large-scale attacks that aim to overwhelm network resources and disrupt service availability.",
                "position": {
                  "row": 4,
                  "col": 1
                }
              }
            }
          },
          "Data & Application Security": {
            "description": "Embeds security into the application lifecycle and data handling practices, including encryption across all data states, robust secrets management, and secure development practices.",
            "position": {
              "row": 2,
              "col": 2
            },
            "layers": {
              "Encryption": {
                "description": "Protects data in storage and on the network using strong encryption algorithms.",
                "position": {
                  "row": 1,
                  "col": 1
                }
              },
              "Secure Software Supply Chain": {
                "description": "Ensures the integrity and trustworthiness of all components within the software stack.",
                "position": {
                  "row": 2,
                  "col": 1
                }
              },
              "DevSecOps & CI/CD Security": {
                "description": "Integrates security into the CI/CD pipeline, ensuring secure coding practices and automated vulnerability scanning.",
                "position": {
                  "row": 3,
                  "col": 1
                }
              }
            }
          },
          "Threat Detection & Response": {
            "description": "Provides real-time monitoring and analysis of system behavior to combat evolving threats, including tools like EDR/XDR, user and entity behavior analytics, and deception technologies.",
            "position": {
              "row": 2,
              "col": 3,
              "rowspan": 2
            },
            "layers": {
              "EDR/XDR": {
                "description": "Monitors endpoints for suspicious behavior and aggregates data across multiple domains for centralized threat correlation.",
                "position": {
                  "row": 1,
                  "col": 1
                }
              },
              "Threat Intelligence & Analytics": {
                "description": "Integrates real-time threat intelligence feeds and machine learning-based analytics to detect anomalies and emerging threats.",
                "position": {
                  "row": 2,
                  "col": 1
                }
              },
              "UEBA & Insider Threat Detection": {
                "description": "Profiles users and entities to detect deviations from established behavior and uncover insider threats.",
                "position": {
                  "row": 3,
                  "col": 1
                }
              },
              "Deception Technologies": {
                "description": "Uses deception tools to lure adversaries into controlled traps, triggering immediate investigation or automated containment.",
                "position": {
                  "row": 4,
                  "col": 1
                }
              }
            }
          },
          "Resilience, Remediation & Compliance": {
            "description": "Ensures systems can recover from compromise while meeting regulatory and operational mandates, covering automated recovery playbooks, audit logging, security chaos engineering, and SBOMs.",
            "position": {
              "row": 1,
              "col": 1,
              "colspan": 3
            },
            "layers": {
              "Remediation & Recovery Playbooks": {
                "description": "Predefined, tested incident response and recovery playbooks embedded into orchestration layers.",
                "position": {
                  "row": 1,
                  "col": 1
                }
              },
              "Security Chaos Engineering": {
                "description": "Deliberately injects faults, attacks, or misconfigurations into systems to test their resilience.",
                "position": {
                  "row": 2,
                  "col": 1
                }
              },
              "Audit Logging & Compliance": {
                "description": "Captures security-relevant events across the stack, ensuring integrity for forensic analysis, compliance audits, and incident reviews.",
                "position": {
                  "row": 3,
                  "col": 1
                }
              },
              "Supply Chain Security & SBOM": {
                "description": "Generates and maintains a complete and traceable Software Bill of Materials for every build artifact.",
                "position": {
                  "row": 4,
                  "col": 1
                }
              }
            }
          }
        }
      }
    }
  },
  "Process Architecture": {
    "name": "Process Architecture",
    "description": "Processes of the system including supporting, strategic and operational processes.",
    "orientation": "back",
    "color": "#ff6f00",
    "position": {
      "row": 2,
      "col": 2
    },
    "layers": {
      "Governance": {
        "description": "Defines rules, policies, and mechanisms established at a higher level.",
        "position": {
          "row": 1,
          "col": 1,
          "colspan": 2
        },
        "layers": {
          "Policy Development": {
            "description": "Formulating policies and regulations. Including ESG.",
            "position": {
              "row": 1,
              "col": 1
            }
          },
          "Legislative Compliance": {
            "description": "Ensuring adherence to laws and regulations.",
            "position": {
              "row": 1,
              "col": 2
            }
          },
          "Ethics and Integrity": {
            "description": "Maintaining ethical standards and preventing corruption.",
            "position": {
              "row": 1,
              "col": 3
            }
          },
          "Audit and Oversight": {
            "description": "Internal and external audits, reviews, and evaluations.",
            "position": {
              "row": 2,
              "col": 1
            }
          },
          "Transparency and Accountability": {
            "description": "Public reporting, disclosure, and citizen engagement.",
            "position": {
              "row": 2,
              "col": 2
            }
          },
          "Data Governance": {
            "description": "Governance of data through out the system.",
            "position": {
              "row": 2,
              "col": 3
            }
          },
          "Legal Services": {
            "description": "Managing legal issues and compliance",
            "position": {
              "row": 3,
              "col": 1
            }
          }
        }
      },
      "Innovation Management": {
        "description": "Focuses on exploring innovative improvements to system capabilities.",
        "position": {
          "row": 2,
          "col": 1
        },
        "layers": {
          "Ideation Processes": {
            "description": "",
            "position": {
              "row": 1,
              "col": 1
            }
          },
          "Research and Development": {
            "description": "Developing new technologies and methodologies.",
            "position": {
              "row": 1,
              "col": 2
            }
          },
          "Develop Digital Services Process": {
            "description": "Implementing digital government services. DevSecOps, scaling and deployment.",
            "position": {
              "row": 1,
              "col": 3
            }
          },
          "Process Improvement": {
            "description": "Enhancing efficiency and effectiveness of government processes.",
            "position": {
              "row": 2,
              "col": 1
            }
          },
          "Partnerships Processes": {
            "description": "Collaborating with private sector for innovation. Including private sector, inter-agencies, and governments.",
            "position": {
              "row": 2,
              "col": 2
            }
          },
          "Citizen Engagement": {
            "description": "Leveraging new technologies to engage and serve citizens better with built-in feedback loops.",
            "position": {
              "row": 2,
              "col": 3
            }
          },
          "PR and Marketing": {
            "description": "Social Media, Websites, Publicity",
            "position": {
              "row": 3,
              "col": 1
            }
          },
          "Revenue Acceleration": {
            "description": "",
            "position": {
              "row": 3,
              "col": 2
            }
          }
        }
      },
      "Operational and Delivery": {
        "description": "Covers routine activities and day-to-day procedures within the organization.",
        "position": {
          "row": 2,
          "col": 2
        },
        "layers": {
          "Service Delivery": {
            "description": "Providing public services to citizens and businesses efficiently and effectively.",
            "position": {
              "row": 1,
              "col": 1
            }
          },
          "Monitoring Processes": {
            "description": "Tracking and reviewing various operational and service metrics for better performance.",
            "position": {
              "row": 1,
              "col": 2
            }
          },
          "Service Maintenance": {
            "description": "Ensuring consistent maintenance and functionality of public services.",
            "position": {
              "row": 1,
              "col": 3
            }
          },
          "Operational Technology Management": {
            "description": "Managing and maintaining technology systems that support operations and services.",
            "position": {
              "row": 2,
              "col": 1
            }
          },
          "Manufacturing Processes": {
            "description": "Overseeing production processes to ensure quality and efficiency in service-related goods.",
            "position": {
              "row": 2,
              "col": 2
            }
          },
          "Business Continuity Disaster Recovery": {
            "description": "Developing and maintaining plans to ensure critical business functions during emergencies.",
            "position": {
              "row": 2,
              "col": 3
            }
          },
          "Data Operations Management": {
            "description": "Managing the storage, processing, and usage of data to ensure its availability and reliability.",
            "position": {
              "row": 3,
              "col": 1
            }
          }
        }
      },
      "Risk Management": {
        "description": "Manages identification, analysis, and mitigation of risks in various operations.",
        "position": {
          "row": 3,
          "col": 1,
          "colspan": 2
        },
        "layers": {
          "Risk Identification": {
            "description": "Identifying potential risks to operations and services.",
            "position": {
              "row": 1,
              "col": 1
            }
          },
          "Risk Analysis": {
            "description": "Assessing the impact and likelihood of risks.",
            "position": {
              "row": 1,
              "col": 2
            }
          },
          "Mitigation Planning": {
            "description": "Developing strategies to mitigate identified risks.",
            "position": {
              "row": 1,
              "col": 3
            }
          },
          "Emergency Preparedness": {
            "description": "Planning and preparation for emergencies and disasters.",
            "position": {
              "row": 2,
              "col": 1
            }
          },
          "Compliance Management": {
            "description": "Ensuring ongoing adherence to risk-related regulations.",
            "position": {
              "row": 2,
              "col": 2
            }
          },
          "Cybersecurity": {
            "description": "",
            "position": {
              "row": 2,
              "col": 3
            }
          }
        }
      },
      "Support": {
        "description": "Includes supporting actions like troubleshooting and external/internal assistance.",
        "position": {
          "row": 4,
          "col": 1,
          "colspan": 2
        },
        "layers": {
          "Human Resources": {
            "description": "Recruiting, hiring, training employees, and managing employee relations to build a productive workforce.",
            "position": {
              "row": 1,
              "col": 1
            }
          },
          "Information Technology (IT)": {
            "description": "Managing IT infrastructure, systems, and services to support organizational goals.",
            "position": {
              "row": 1,
              "col": 2
            }
          },
          "Infrastructure Management": {
            "description": "Monitoring, maintaining, and developing public infrastructure for efficient operations.",
            "position": {
              "row": 1,
              "col": 3
            }
          },
          "Network Communications Processes": {
            "description": "Managing systems and processes for seamless and secure network communications.",
            "position": {
              "row": 2,
              "col": 1
            }
          },
          "Facilities Management": {
            "description": "Overseeing the maintenance, functionality, and safety of physical facilities and buildings.",
            "position": {
              "row": 2,
              "col": 2
            }
          },
          "Financial Management": {
            "description": "Handling budgeting, financial reporting, and ensuring compliance with financial regulations.",
            "position": {
              "row": 2,
              "col": 3
            }
          },
          "Procurement and Supply Chain": {
            "description": "Acquiring goods and services necessary to support operations and manage supply chains effectively.",
            "position": {
              "row": 3,
              "col": 1
            }
          }
        }
      }
    }
  },
  "Organizational Architecture": {
    "name": "Organizational Architecture",
    "description": "People centric organizational structure of the system.",
    "orientation": "left",
    "color": "#228B22",
    "position": {
      "row": 2,
      "col": 1
    },
    "assets": {
      "GEAR1": {
        "name": "GEAR Architecture document",
        "url": "https://www.intel.com/content/www/us/en/content-details/790385/government-conceptual-enterprise-architecture-gear.html?wapkw=Government%20Enterprise%20Architecture",
        "description": "Overview of the GEAR architecture and its uses."
      },
      "GEARVideo": {
        "name": "Video: Government Enterprise Architecture Basics: A Simple Explanation",
        "url": "https://www.youtube.com/watch?v=Ou9FHodTamk",
        "description": "In this episode, we delve into the world of leveraging enterprise architecture in government settings, specifically focusing on the benefits and strategies involved. From understanding the fundamentals of enterprise architecture frameworks to embracing digital transformation, we explore how organizations can drive value and efficiency through proper architectural planning. Join us as we discuss the significance of architecture in government operations and the role it plays in achieving organizational goals. If you are interested in learning more about enterprise architecture and its impact on government entities, this insightful discussion is for you."
      }
    },
    "layers": {
      "Stakeholders": {
        "description": "All stakeholders involved in decision-making and system requirements.",
        "position": {
          "row": 1,
          "col": 1,
          "colspan": 4
        }
      },
      "Personas": {
        "description": "Different personas representing user groups interacting with the system.",
        "position": {
          "row": 2,
          "col": 1,
          "colspan": 3
        }
      },
      "Communication Channels": {
        "description": "Channels of communication between system users, stakeholders, and decision-makers.",
        "position": {
          "row": 2,
          "col": 4,
          "rowspan": 2
        }
      },
      "Roles & Responsibilities": {
        "description": "Defines specific tasks and duties assigned to different entities.",
        "position": {
          "row": 3,
          "col": 1
        }
      },
      "Skills & Competencies": {
        "description": "Profiles skills and abilities required for system operations.",
        "position": {
          "row": 3,
          "col": 2
        }
      },
      "Structure": {
        "description": "Maps the hierarchical structure of the organization supporting the system.",
        "position": {
          "row": 3,
          "col": 3
        }
      },
      "Culture & Values": {
        "description": "Refers to the organizational culture, values, and principles guiding how operations are conducted.",
        "position": {
          "row": 4,
          "col": 1,
          "colspan": 4
        }
      }
    }
  }
}